bench_quick.txt
make DURATION=5s WARMUP_DURATION=2s
make[1] : on entre dans le répertoire « /home/chris/Projets/Personal/knowledges/postgres-for-everything/caching »
=== Compiling Go Benchmark Server ===
Build successful: ./bin/server
========================================================
 STARTING SEQUENTIAL CACHE BENCHMARK
 Concurrency: 250 connections | Duration: 5s
 Server Limits: 4 CPU (GOMAXPROCS) | 4G RAM (GOMEMLIMIT)
========================================================

========================================================
 ENGINE: memory 
========================================================
Stopping PostgreSQL and Valkey for memory isolation...
Ensuring port 8080 is clear...
Starting server with GOMAXPROCS=4 and GOMEMLIMIT=4GiB...
Waiting for server (PID 675933) to be ready on port 8080...
Executing GET benchmark...
Bombarding http://localhost:8080/memory/get for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec    133705.83   31930.70  207068.24
  Latency        1.86ms   782.83us    32.13ms
  Latency Distribution
     50%     1.43ms
     75%     2.53ms
     90%     3.83ms
     95%     4.86ms
     99%     7.54ms
  HTTP codes:
    1xx - 0, 2xx - 670354, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.08MB/s
Executing SET benchmark...
Bombarding http://localhost:8080/memory/set for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec    117026.04   31698.69  168785.93
  Latency        2.14ms     1.16ms    39.45ms
  Latency Distribution
     50%     1.60ms
     75%     2.86ms
     90%     4.39ms
     95%     5.64ms
     99%     9.37ms
  HTTP codes:
    1xx - 0, 2xx - 583368, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    25.36MB/s
Stopping server (PID 675933)...
Finished memory benchmark.

========================================================
 ENGINE: valkey 
========================================================
Stopping PostgreSQL and starting Valkey...
Ensuring port 8080 is clear...
Starting server with GOMAXPROCS=4 and GOMEMLIMIT=4GiB...
Waiting for server (PID 676124) to be ready on port 8080...
Executing GET benchmark...
Bombarding http://localhost:8080/valkey/get for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec     52225.81   15720.53   96913.48
  Latency        4.79ms     1.97ms    49.29ms
  Latency Distribution
     50%     4.20ms
     75%     6.01ms
     90%     8.26ms
     95%    10.13ms
     99%    15.13ms
  HTTP codes:
    1xx - 0, 2xx - 261086, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.21MB/s
Executing SET benchmark...
Bombarding http://localhost:8080/valkey/set for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec     46200.06   10062.09   68696.95
  Latency        5.41ms     1.98ms    50.76ms
  Latency Distribution
     50%     4.85ms
     75%     6.75ms
     90%     9.02ms
     95%    10.70ms
     99%    15.77ms
  HTTP codes:
    1xx - 0, 2xx - 230772, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    10.03MB/s
Stopping server (PID 676124)...
Finished valkey benchmark.

========================================================
 ENGINE: standard-postgresql 
========================================================
Stopping Valkey and starting PostgreSQL...
Ensuring port 8080 is clear...
Starting server with GOMAXPROCS=4 and GOMEMLIMIT=4GiB...
Waiting for server (PID 676718) to be ready on port 8080...
Warm-up phase: préchauffage de PostgreSQL (2s)...
Executing GET benchmark...
Bombarding http://localhost:8080/postgres/get for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec     20264.27    4387.82   30807.23
  Latency       12.36ms     3.00ms    63.92ms
  Latency Distribution
     50%    11.83ms
     75%    13.87ms
     90%    16.32ms
     95%    18.42ms
     99%    26.22ms
  HTTP codes:
    1xx - 0, 2xx - 101146, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.22MB/s
Executing SET benchmark...
Bombarding http://localhost:8080/postgres/set for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec      9517.09    3763.54   17045.89
  Latency       26.25ms    14.07ms   195.98ms
  Latency Distribution
     50%    22.56ms
     75%    29.21ms
     90%    39.23ms
     95%    46.76ms
     99%    65.08ms
  HTTP codes:
    1xx - 0, 2xx - 47729, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.08MB/s
Stopping server (PID 676718)...
Finished standard-postgresql benchmark.

========================================================
 ENGINE: optimized-postgresql 
========================================================
Stopping Valkey and starting PostgreSQL...
Ensuring port 8080 is clear...
Starting server with GOMAXPROCS=4 and GOMEMLIMIT=4GiB...
Waiting for server (PID 676985) to be ready on port 8080...
Warm-up phase: préchauffage de PostgreSQL (2s)...
Executing GET benchmark...
Bombarding http://localhost:8080/postgres/get for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec     25281.67    5498.28   39667.56
  Latency        9.87ms     2.35ms    38.54ms
  Latency Distribution
     50%     9.37ms
     75%    11.33ms
     90%    13.78ms
     95%    15.98ms
     99%    21.31ms
  HTTP codes:
    1xx - 0, 2xx - 126598, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.03MB/s
Executing SET benchmark...
Bombarding http://localhost:8080/postgres/set for 5s using 250 connection(s)


Statistics        Avg      Stdev        Max
  Reqs/sec     28215.89    6499.14   42434.40
  Latency        8.83ms     2.69ms    51.88ms
  Latency Distribution
     50%     8.29ms
     75%    10.19ms
     90%    12.64ms
     95%    14.55ms
     99%    20.88ms
  HTTP codes:
    1xx - 0, 2xx - 141545, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.20MB/s
Stopping server (PID 676985)...
Finished optimized-postgresql benchmark.
========================================================
 ALL BENCHMARKS COMPLETED SUCCESSFULLY
========================================================
make[1] : on quitte le répertoire « /home/chris/Projets/Personal/knowledges/postgres-for-everything/caching »